app/Controllers/ProductController.php

INSERT INTO `products` (`nama_product`, `description`) VALUES ('Mobil', 'alphard V32')
---
    public function insertProduct(){
        $data = [
            'nama_product' => 'Buah Gomu Gomu',
            'description' => 'Zoan tipe Mitologi',
        ];

        $this->product->insert($data);

SELECT *
FROM `products`
---
    public function readProduct(){
        $products = $this->product->findAll();

SELECT *
FROM `products`
WHERE `id` = '6'
 LIMIT 1
---
    public function getProduct($id) {

        $product = $this->product->where('id',$id)->first();

UPDATE `products` SET `nama_product` = 'Mobil', `description` = 'Supra'
WHERE `products`.`id` IN ('5')
SELECT *
FROM `products`
---
    public function updateProduct($id) {
        $data = [
            'nama_product' => $this->request->getVar('nama_product'),
            'description' => $this->request->getVar('description')
        ];

        if (!$this->product->update($id, $data)) {
            return redirect()->to(base_url('readproduct'))->with('error', 'Gagal memperbarui produk.');
        }

        return redirect()->to(base_url('readproduct'))->with('success', 'Produk berhasil diperbarui.');

DELETE FROM `products`
WHERE `id` IN ('4')
---
    public function deleteProduct($id) {
        $this->product->delete($id);