app/Controllers/ProductController.php

    public function updateProduct($id) {
        $data = [
            'nama_product' => $this->request->getVar('nama_product'),
            'description' => $this->request->getVar('description')
        ];

        if (!$this->product->update($id, $data)) {
            return redirect()->to(base_url('readproduct'))->with('error', 'Gagal memperbarui produk.');
        }

        return redirect()->to(base_url('readproduct'))->with('success', 'Produk berhasil diperbarui.');
---
SELECT *
FROM `products`